Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum
The cardinal point types of the analysis bar.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_CENTROID
The cardinal point is centroid.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_TOP_LEFT
The cardinal point is top left.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_TOP_CENTER
The cardinal point is top center.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_TOP_RIGHT
The cardinal point is top right.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_MIDDLE_LEFT
The cardinal point is middle left.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_MIDDLE_CENTER
The cardinal point is middle center.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_MIDDLE_RIGHT
The cardinal point is middle right.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_BOTTOM_LEFT
The cardinal point is bottom left.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_BOTTOM_CENTER
The cardinal point is bottom center.

Tekla.Structures.Analysis.AnalysisBar.CardinalPointEnum.CARDINAL_POINT_BOTTOM_RIGHT
The cardinal point is bottom right.